Masmiseim36/nxpSDK/devices/MK22F51212/cmsis_drivers/fsl_i2c_cmsis.c
    masterXfer.slaveAddress   = (uint8_t)addr;                      /* 7-bit slave address.*/
    masterXfer.direction      = kI2C_Read;                          /* Transfer direction.*/
    masterXfer.subaddress     = 0U;                                 /* Sub address */
    masterXfer.subaddressSize = 0U;                                 /* Size of command buffer.*/
    masterXfer.data           = data;                               /* Transfer buffer.*/
    masterXfer.dataSize       = num;                                /* Transfer size.*/
    masterXfer.flags          = (uint32_t)kI2C_TransferDefaultFlag; /* Transfer flag which controls the transfer.*/

    if ((i2c->resource->base->S & 0x20U) != 0U)
    {
        masterXfer.flags |= (uint32_t)kI2C_TransferRepeatedStartFlag;
    }

    if (xfer_pending)
    {
        masterXfer.flags |= (uint32_t)kI2C_TransferNoStopFlag;
    }

    status = I2C_MasterTransferEDMA(i2c->resource->base, i2c->master_edma_handle, &masterXfer);

    switch (status)
    {
        case kStatus_Success:
            ret = ARM_DRIVER_OK;
            break;

        case kStatus_I2C_Busy:
            ret = ARM_DRIVER_ERROR_BUSY;
            break;

        case kStatus_I2C_Timeout:
            ret = ARM_DRIVER_ERROR_TIMEOUT;
            break;

        default:
            ret = ARM_DRIVER_ERROR;
            break;
    }

    return ret;
}

static int32_t I2C_Master_EdmaGetDataCount(cmsis_i2c_edma_driver_state_t *i2c)
{
    size_t cnt; /* The number of currently transferred data bytes */

    (void)I2C_MasterTransferGetCountEDMA(i2c->resource->base, i2c->master_edma_handle, &cnt);

    return (int32_t)cnt;
}

static int32_t I2C_Master_EdmaControl(uint32_t control, uint32_t arg, cmsis_i2c_edma_driver_state_t *i2c)
{
    uint32_t baudRate_Bps  = 0;
    volatile uint8_t dummy = 0;
    int32_t result         = ARM_DRIVER_OK;
    /* Add this to avoid warning. */
    dummy++;

    switch (control)
    {
        /* Not supported */
        case ARM_I2C_OWN_ADDRESS:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;

        /* Set Bus Speed; arg = bus speed */
        case ARM_I2C_BUS_SPEED:
            switch (arg)
            {
                case ARM_I2C_BUS_SPEED_STANDARD:
                    baudRate_Bps = 100000;
                    break;

                case ARM_I2C_BUS_SPEED_FAST:
                    baudRate_Bps = 400000;
                    break;

                case ARM_I2C_BUS_SPEED_FAST_PLUS:
                    baudRate_Bps = 1000000;
                    break;

                default:
                    result = ARM_DRIVER_ERROR_UNSUPPORTED;
                    break;
            }
            if (result == ARM_DRIVER_OK)
            {
                I2C_MasterSetBaudRate(i2c->resource->base, baudRate_Bps, (i2c->resource->GetFreq)());
            }

            break;
        /* Not supported */
        case ARM_I2C_BUS_CLEAR:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;

        /* Aborts the data transfer  when Master for Transmit or Receive */
        case ARM_I2C_ABORT_TRANSFER:

            if ((i2c->resource->base->C1 & (uint8_t)I2C_C1_MST_MASK) != 0U)
            {
                /* Disable edma */
                I2C_MasterTransferAbortEDMA(i2c->resource->base, i2c->master_edma_handle);
                /* If master receive */
                if (i2c->master_edma_handle->transfer.direction == kI2C_Read)
                {
                    i2c->resource->base->C1 |= (uint8_t)I2C_C1_TXAK_MASK;
                    while (0U == (i2c->resource->base->S & (uint8_t)I2C_S_TCF_MASK))
                    {
                    }
                    i2c->resource->base->C1 &=
                        ~((uint8_t)I2C_C1_MST_MASK | (uint8_t)I2C_C1_TX_MASK | (uint8_t)I2C_C1_TXAK_MASK);
                    dummy = i2c->resource->base->D;
                }
                /* If master transmit */
                else
                {
                    while (0U == (i2c->resource->base->S & (uint8_t)I2C_S_TCF_MASK))
                    {
                    }
                    i2c->resource->base->C1 &=
                        ~((uint8_t)I2C_C1_MST_MASK | (uint8_t)I2C_C1_TX_MASK | (uint8_t)I2C_C1_TXAK_MASK);
                }

                i2c->master_edma_handle->transferSize      = 0;
                i2c->master_edma_handle->transfer.data     = NULL;
                i2c->master_edma_handle->transfer.dataSize = 0;
            }
            break;
        default:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;
    }
    return result;
}

static int32_t I2C_Master_EdmaPowerControl(ARM_POWER_STATE state, cmsis_i2c_edma_driver_state_t *i2c)
{
    int32_t result = ARM_DRIVER_OK;
    switch (state)
    {
        /* Terminates any pending data transfers, disable i2c moduole and i2c clock and related edma */
        case ARM_POWER_OFF:
            if ((i2c->flags & (uint8_t)I2C_FLAG_POWER) != 0U)
            {
                (void)I2C_Master_EdmaControl(ARM_I2C_ABORT_TRANSFER, 0, i2c);
                I2C_MasterDeinit(i2c->resource->base);
                DMAMUX_DisableChannel(i2c->edmaResource->i2cDmamuxBase, i2c->edmaResource->i2cEdmaChannel);
                i2c->flags = (uint8_t)I2C_FLAG_INIT;
            }
            break;
        /* Not supported */
        case ARM_POWER_LOW:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;
        /* Enable i2c moduole and i2c clock */
        case ARM_POWER_FULL:
            if (i2c->flags == (uint8_t)I2C_FLAG_UNINIT)
            {
                return ARM_DRIVER_ERROR;
            }

            if ((i2c->flags & (uint8_t)I2C_FLAG_POWER) != 0U)
            {
                /* Driver already powered */
                break;
            }

            CLOCK_EnableClock(s_i2cClocks[I2C_GetInstance(i2c->resource->base)]);
            i2c->resource->base->C1 = I2C_C1_IICEN(1);
            i2c->flags |= (uint8_t)I2C_FLAG_POWER;
            break;
        default:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;
    }

    return result;
}

