Masmiseim36/nxpSDK/devices/MK22F51212/cmsis_drivers/fsl_i2c_cmsis.c
static ARM_I2C_STATUS I2C3_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C3_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C3 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
#if (defined(RTE_I2C3_DMA_EN) && RTE_I2C3_DMA_EN)
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                              I2C3_Master_EdmaInitialize,
                              I2C3_Master_EdmaUninitialize,
                              I2C3_Master_EdmaPowerControl,
                              I2C3_Master_EdmaTransmit,
                              I2C3_Master_EdmaReceive,
                              NULL,
                              NULL,
                              I2C3_Master_EdmaGetDataCount,
                              I2C3_Master_EdmaControl,
                              I2C3_Master_EdmaGetStatus
#else
                              I2C3_Master_DmaInitialize,
                              I2C3_Master_DmaUninitialize,
                              I2C3_Master_DmaPowerControl,
                              I2C3_Master_DmaTransmit,
                              I2C3_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C3_Master_DmaGetDataCount,
                              I2C3_Master_DmaControl,
                              I2C3_Master_DmaGetStatus
#endif
#else
                              I2C3_InterruptInitialize,
                              I2C3_InterruptUninitialize,
                              I2C3_InterruptPowerControl,
                              I2C3_Master_InterruptTransmit,
                              I2C3_Master_InterruptReceive,
                              I2C3_Slave_InterruptTransmit,
                              I2C3_Slave_InterruptReceive,
                              I2C3_InterruptGetDataCount,
                              I2C3_InterruptControl,
                              I2C3_InterruptGetStatus
#endif
};

#endif
